yuplus/nxp-mcx-series/MCXA366/drivers/fsl_lpi2c.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2022, 2024-2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_lpi2c.h"
#include <stdlib.h>
#include <string.h>

/*
 * $Coverage Justification Reference$
 *
 * $Justification fsl_lpi2c_c_ref_1$
 * The default branch cannot be executed in any circumstances, it is only added to avoid MISRA violation.
 *
 * $Justification fsl_lpi2c_c_ref_2$
 * Two instances failed to simulate #kStatus_LPI2C_Busy.
 *
 * $Justification fsl_lpi2c_c_ref_3$
 * When the transmission is completed (remaining == 0), the SDF and RSF will be set, and the flags are get before
 * that(get before set), it will be over when the next cycle occurs, the first condition cannot be verified, and the
 * remaining will not be verified.(will improve)
 *
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.lpi2c"
#endif

#if defined(LPI2C_RSTS)
#define LPI2C_RESETS_ARRAY LPI2C_RSTS
#endif

/*! @brief LPI2C master fifo commands. */
enum
{
    kTxDataCmd = LPI2C_MTDR_CMD(0x0U), /*!< Transmit DATA[7:0] */
    kRxDataCmd = LPI2C_MTDR_CMD(0X1U), /*!< Receive (DATA[7:0] + 1) bytes */
    kStopCmd   = LPI2C_MTDR_CMD(0x2U), /*!< Generate STOP condition */
    kStartCmd  = LPI2C_MTDR_CMD(0x4U), /*!< Generate(repeated) START and transmit address in DATA[[7:0] */
};

/*!
 * @brief Default watermark values.
 *
 * The default watermarks are set to zero.
 */
enum
{
    kDefaultTxWatermark = 0,
    kDefaultRxWatermark = 0,
};

/*! @brief States for the state machine used by transactional APIs. */
enum
{
    kIdleState = 0,
    kSendCommandState,
    kIssueReadCommandState,
    kTransferDataState,
    kStopState,
    kWaitForCompletionState,
};

/*!
 * @brief Structure definition for variables that passed as parameters in LPI2C_RunTransferStateMachine.
 * The structure is private.
 */
typedef struct _lpi2c_state_machine_param
{
    bool state_complete; /*!< status of complete */
    size_t rxCount;      /*!< rx count */
    size_t txCount;      /*!< tx count */
    uint32_t status;     /*!< machine status */
} lpi2c_state_machine_param_t;

/*! @brief Typedef for slave interrupt handler. */
typedef void (*lpi2c_slave_isr_t)(LPI2C_Type *base, lpi2c_slave_handle_t *handle);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static uint32_t LPI2C_GetCyclesForWidth(
    uint32_t sourceClock_Hz, uint32_t width_ns, uint32_t minCycles, uint32_t maxCycles, uint32_t prescaler);

static status_t LPI2C_MasterWaitForTxReady(LPI2C_Type *base);

static status_t LPI2C_RunTransferStateMachine(LPI2C_Type *base, lpi2c_master_handle_t *handle, bool *isDone);

static void LPI2C_InitTransferStateMachine(lpi2c_master_handle_t *handle);

static status_t LPI2C_SlaveCheckAndClearError(LPI2C_Type *base, uint32_t flags);

#if !(defined(FSL_FEATURE_I2C_HAS_NO_IRQ) && FSL_FEATURE_I2C_HAS_NO_IRQ)
#if !(defined(FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ) && FSL_FEATURE_LPI2C_HAS_ROLE_SPLIT_IRQ)
static void LPI2C_CommonIRQHandler(LPI2C_Type *base, uint32_t instance);
#endif
#endif

/*!
 * @brief introduce function LPI2C_TransferStateMachineSendCommandState.
 * This function was deal with Send Command State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param variable_set Pass the address of the parent function variable.
 * @retval #kStatus_Success
 * @retval #kStatus_LPI2C_Timeout
 */
static status_t LPI2C_TransferStateMachineSendCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams);

/*!
 * @brief introduce function LPI2C_TransferStateMachineIssueReadCommandState.
 * This function was deal with Issue Read Command State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 */
static void LPI2C_TransferStateMachineReadCommand(LPI2C_Type *base,
                                                  lpi2c_master_handle_t *handle,
                                                  lpi2c_state_machine_param_t *stateParams);

/*!
 * @brief introduce function LPI2C_TransferStateMachineTransferDataState.
 * This function was deal with init Transfer Data State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 */
static void LPI2C_TransferStateMachineTransferData(LPI2C_Type *base,
                                                   lpi2c_master_handle_t *handle,
                                                   lpi2c_state_machine_param_t *stateParams);

/*!
 * @brief introduce function LPI2C_TransferStateMachineStopState.
 * This function was deal with Stop State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 * @param[out] isDone Set to true if the transfer has completed.
 */
static void LPI2C_TransferStateMachineStopState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone);

/*!
 * @brief introduce function LPI2C_TransferStateMachineWaitState.
 * This function was deal with Wait For Completion State.
 *
 * @param base The I2C peripheral base address.
 * @param handle Master nonblocking driver handle.
 * @param stateParams Pass the address of the parent function variable.
 * @param[out] isDone Set to true if the transfer has completed.
 */
static void LPI2C_TransferStateMachineWaitState(LPI2C_Type *base,
                                                lpi2c_master_handle_t *handle,
                                                lpi2c_state_machine_param_t *stateParams,
                                                bool *isDone);

